# Database Design

## Structure of a Data Warehouse

Facts and Dimensions
Consider a bank that has thousands of ATMs across India. In every transaction, the following variables are recorded:

Withdrawal amount
Account balance after withdrawal
Transaction charge amount
Customer ID
ATM ID
Date of withdrawal
Which of the variables above are fact variables (select all that apply)?


Withdrawal amount


Account balance after withdrawal


Transaction charge amount

✓ this all are Correct

Dimensional Modelling
What are the benefits of having dimension variables apart from facts? More than one option may be correct.


It helps with performing various types of analyses, such as sector-wise, country-wise or funding-type-based analyses    ✓ Correct

It helps in summarising the fact variables by calculating their sum, average, range, etc.


It helps with extracting specific, useful information, such as the total investment made in the Automobile sector in India between 2014 and 2015.   ✓ Correct

### Star Schema

Star Schema
In a star schema, what is the name of the table that contains the metadata that is needed for analysing numerical/quantitative data?


Fact table


Dimension table    ✓ Correct

## OLAP vs OLTP

OLAP vs OLTP
Which of the following statement(s) is/are true? More than one option may be correct.


In OLAP systems, data is taken from a single data source.


Compared with OLTP, OLAP systems use complex queries to perform tasks, because in OLAP, we perform analysis on various tables and it needs complex queries.   ✓ Correct

OLAP systems use ETL.   ✓ Correct

Schemas are an essential part of creating OLAP systems.   ✓ Correct

OLAP vs OLTP
List the types of databases that are used to perform each of the following operations:

Making a purchase
Withdrawing cash from an ATM
Finding the average sales of a local store
Finding profits by region for a specific product of a food MNC
 

1 - Transactional, 2 - Transactional, 3 - Transactional and data warehouse, 4 - Data warehouse     ✓ Correct

OLAP vs OLTP
Choose the correct statement from the following options given below:


Transactional databases and data warehouse databases use a similar front-end interface.


Dimension modelling is used to create a transactional database.


Data is stored differently in a transactional database and a data warehouse database.    ✓ Correct

## Entity Constraints

Use of Entity Constraints
Entity constraints are used to:


Improve the quality of data entered for a specific property.


Control who is allowed access to the data.


Ensure that duplicate records are not entered into the table.     ✓ Correct

Primary Keys
A primary key constraint always enforces both the UNIQUE and NOT NULL constraints.


True    ✓ Correct

## Referential Constraints

In [ ]:
An Example of a Referential Constraint
Which of the following scenarios would require using a referential constraint?


All phone numbers should contain the area code.


Certain fields are mandatory to fill (such as phone number) before the record is accepted in a database.


Information on a customer must be known before anything can be sold to that customer, so that you can refer to other fields to get the information of the customers.

✓ Correct

## Semantic Constraints

Semantic Constraints
Consider a column containing the blood groups of various blood donors. Which of the following options is an example of a semantic constraint in this case? More than one option may be correct.


A blood group can contain one of the following values: A, B, AB and O.  ✓ Correct

A blood group can contain only characters.    ✓ Correct

Types of Constraints
Which of the following constraints does not enforce uniqueness?


Primary Key


Foreign Key    ✓ Correct

Types of Constraints
Allowing only certain values in a column and ensuring that the values are in a specified format or belong to a certain range are examples of:


Referential Constraints


Semantic Constraints    ✓ Correct

## ERDs

Entity-Relationship Diagram – Classic Models

Refer to the ERD given above for the 'classic models' data set. Which of the following statement(s) is/are correct?

An employee is associated with zero or more customers, whereas a customer is associated with zero or one employee.   ✓ Correct

A customer is associated with zero or more employees, whereas an employee is associated with zero or one customer.


A customer can have zero or more orders, whereas an order is associated with one and only one customer.     ✓ Correct

Primary Key
Which of the following fields can be a possible primary key of the ‘marks’ table? Multiple options can be correct.


grades   ✓ Correct

marks_range   ✓ Correct

Foreign Key
What is/are the foreign key(s) in the ‘Student’ table? Multiple options can be correct.


student_id


marks_range   ✓ Correct

year


branch_id   ✓ Correct

Primary and Foreign Keys
Choose the correct statements for the ‘HoD’ table from the options given below. Multiple options can be correct.


‘branch_id’ can be the primary key of the ‘HoD’ table.


‘branch_id’ is the foreign key of the ‘HoD’ table.   ✓ Correct

‘branch_id’ and ‘year_of_service_as_HoD’ can be the composite primary key of the ‘HoD’ table.    ✓ Correct

Primary and Foreign Keys
Which of the following statements could be correct?


In the ‘Branch’ table, ‘branch_id’ can have NULL values.


In the ‘Student’ table, ‘marks_range’ can have NULL values.    ✓ Correct

## Star Schema: A Demonstration

Fact Variables
How many fact variables are present in the 'cust_dimen' table used in the market star schema explained in the video?

Note: Fact variables are those variables that have some numeric values in them.
    
0    ✓ Correct

Fact or Dimension?
Which type of variable is 'Order_ID' in the 'shipping_dimen' table?

shipping_dimen

Ship_id VARCHAR(12)

Order_ID INT(11)

Ship_Mode VARCHAR(25)

Ship_Date DATE


Fact Variable


Dimension Variable    ✓ Correct

# Database Creation in the MySQL Workbench

## Introduction to DDL and DML Statements

SQL Command Types
Which of the following command type(s) is/are available in SQL?


Data Modification Language


Data Definition Language    ✓ Correct

Data Manipulation Language   ✓ Correct

## DDL Statements: A Demonstration

DDL Statements
DDL statements perform operations on which of the following database objects?


Rows


Columns


Tables   ✓ Correct

## DML Statements: A Demonstration

DML Statements
DML statements are used for:


Deleting the data in a database   ✓ Correct

Inserting data into a database   ✓ Correct

## Practice Exercise – DDL and DML Statements

DDL and DML Statements
Consider the following statements:

CREATE

INSERT

UPDATE

DELETE

ALTER

DROP

TRUNCATE

RENAME

Based on the types of DDL/DML statements, select the correct answers from the options given below. Multiple options may be correct.


CREATE, UPDATE, DELETE and DROP are DDL statements.


SELECT, UPDATE, ALTER, DROP and RENAME are DML statements.


CREATE, ALTER, DROP, RENAME and TRUNCATE are DDL statements.    ✓ Correct

SELECT, INSERT, UPDATE and DELETE are DML statements.     ✓ Correct

DDL and DML Statements
What is the difference between the 'DROP' and 'TRUNCATE' commands?


‘TRUNCATE’ removes a table completely from the database, and you cannot retrieve this table. All the integrity constraints are removed. On the other hand, ‘DROP’ only drops the table rows; it does not delete the schema of the table from the database.


‘DROP’ removes a table completely from the database, and you cannot retrieve this table. All the integrity constraints are removed. On the other hand, ‘TRUNCATE’ only drops the table rows; it does not delete the schema of the table from the database.     ✓ Correct

DDL and DML Statements
Suppose you want to create a table named 'mobile_phone', which contains the following columns: 

Mobile_phone_ID, which is of integer type
Camera, which is of string type
RAM, which is of integer type
Memory, which is of string type
The primary key of this table is 'Mobile_phone_ID'.

What would be the correct SQL query to create such a table? Also, identify the type of operation, i.e., whether it is a DDL statement or a DML statement.



It is a DDL statement.

    

create table mobile_phone (

     Mobile_phone_ID int(11) NOT NULL,

     Camera varchar(12),

     RAM int(11),

     Memory varchar(12),

     Primary Key (Mobile_phone_ID)

     );        ✓ Correct

DDL and DML Statements
Suppose you want to add a new column, 'price', with ‘float’ as the data type, in the table 'mobile_phone'. What is the correct query to add this new column?


ALTER 'mobile_phone' ADD COLUMN 'price' float(24)

ADD COLUMN 'price' float(24) IN TABLE 'mobile_phone'

ALTER TABLE 'mobile_phone' ADD COLUMN 'price' float(24)    ✓ Correct

DDL and DML Statements
Suppose you want to update the value of ‘Camera’ to 15MP, where RAM = 8. What would be the correct query to perform such an operation?


update mobile_phone
set Camera= '15MP'
where RAM= 8;         ✓ Correct

## Querying in MySQL

## SQL Statements and Operators

Pattern Matching
What would be the output of the following query: 'select * from employee where first_name like "%ee%";'?


It will display the details of all the employees whose name contains ‘ee’.    ✓ Correct

Reading the Documentation
Refer to the MySQL documentation online and answer the following question:

Which of the following wildcards are supported in SQL?


% only


_ (underscore) only


* only


Both % and _ (underscore)     ✓ Correct

Operators
With SQL, how do you select all the records from a table named ‘employees’ where the ‘LastName’ is alphabetically between (and includes) ‘Joshi’ and ‘Sharma’?


select * from employees where LastName > ‘Joshi’ and LastName < ‘Sharma’;


select * from employees where LastName between ‘Joshi’ and ‘Sharma’;    ✓ Correct

Operators
Which of the queries given below would return the same output? More than one option may be correct.


select * from employees where EmpID in (2,3,4, 5);    ✓ Correct

select * from employees where EmpID between 2 and 5;    ✓ Correct

select * from employees where EmpID >= 2 and EmpID <= 5;    ✓ Correct

Basic Select
Description
Consider the following table employees containing the following columns:

ans:
    
use upgrad;

select firstName from Employees;

## Aggregate Functions

Aggregate Functions
Which of the following are not aggregate functions in MySQL? Multiple options can be correct.


min()


mean()   ✓ Correct

max()


mode()    ✓ Correct

Count Querying
Description
Consider the employees table having the following columns.

Write a query to retrieve the total number of employees, do the aliasing of count as totalEmployees.

ans:
    
use upgrad;

select count(*) as totalEmployees from employees;

## Ordering

Basic Ordering
Description
Given an employees table with the following columns:
    
Write a query to retrieve the list of first names of employees in the alphabetical order.

ans:
    
use upgrad;

select firstName from employees order by firstName asc;

## The Having Clause

Keywords in SQL
Arrange the keywords below in order of their occurrence in a query:

group by
order by
select
where
from
limit
having

3 - 5 - 4 - 1 - 2 - 7 - 6


3 - 5 - 1 - 4 - 2 - 6 - 7


3 - 5 - 4 - 1 - 7 - 2 - 6    ✓ Correct

## String and Date–Time Functions

String Manipulation
Assume that an employee named Diane Murphy has an employee number of 1002 in a dataset. What would the output of the following set of commands?

SELECT CONCAT(REVERSE(firstName) , '  ', UPPER(lastName))
FROM employees
WHERE employeeNumber=1002;
 


Diane MURPHY


Enaid Murphy


enaiD MURPHY    ✓ Correc

Math Functions
abs() – Returns the absolute value of a number
ceil() – Returns the smallest integer value greater than or equal to the input number
floor() – Returns the largest integer value not greater than the argument
round() – Rounds a number to a specified number of decimal places
rand() – Returns a random floating-point value between 0 and 1
pow(a, b) – Returns the value a^b

 

Given the above math functions used in MySQL, what would the query given below return?


select ceil(rand() * 6);


A random floating-point value from 0 to 6.


A random floating-point value from 1 to 6.


A random integer from 0 to 6.     ✓ Correct

Basic String Functions
Description
Given an employees table with the following columns:
    
Write a query to retrieve the full names of all the employees along with their employee numbers.

ans:
    
use upgrad;

select employeeNumber, concat(firstName, ' ', lastName) as fullName from employees;

## Regular Expressions

SQL Queries
Which of the following keyword(s) can be used in a query to obtain the details of all the cars that have the substring toy in their brand names?


like    ✓ Correct

regexp    ✓ Correct

Basic Regex
Description
Given a table named employees with the following columns:

Write a query to retrieve the employee numbers and first names of all employees having the substring on in their first names.

ans:
    
use upgrad;

select employeeNumber, firstName
from employees
where firstName regexp 'on';

## Nested Queries

Subqueries
Description
Given a table named customers with the following columns:
    
Write a query to retrieve the names of all customers who have a credit limit greater than what La Rochelle Gifts has.

ans:
    
use upgrad;

select customerName
from customers
where creditLimit >
	(select creditLimit
    from customers
    where customerName = 'La Rochelle Gifts'
    )
    order by creditLimit;

## CTEs

CTEs vs Derived Tables
A derived table is basically a subquery, except it is always in the FROM clause of an SQL statement. Given this information, is the following statement true or false?

 

Common Table Expressions is another name for derived tables.


True


False   ✓ Correct

# Joins and Set Operations

## Set Theory

Set Theory
Write the value of B - A from the example in the text given above.

ans:
    
{ 3, 5, 7 }

## Types of Joins

Joins in a Star Schema
What is the maximum number of tables that can be joined in a star schema in a single query?


2


3   ✓ Correct

Types of Joins
Consider the two tables given below.

Which query would you write to retrieve all employees from the Employees table along with the respective departments that can be obtained from the Departments table?


select last_name, dept_name

ans:

from employees e

left join departments d

on e.dept_id = d.dept_id;     ✓ Correct

## Types of Joins: A Demonstration

'On' vs 'Using' Keyword
State whether the following statement is true or false.

Every SQL statement containing a 'join' keyword can be rewritten with a 'using' keyword.

True


False    ✓ Correct

Types of Joins
Description
Given a table named customers and a table named orders with the following columns:
    
Write a query to list the names of all customers who have placed at least one order.

ans:
    
use upgrad;

select distinct customerName
from customers c
inner join orders o
on c.customerNumber = o.customerNumber
where orderNumber is not null;

## Outer Joins: A Demonstration

Inner vs. Outer Join
What is the difference between an inner join and an outer join operation?


There is no difference.


An inner join preserves a few values that are otherwise lost in an outer join.


An outer join preserves a few values that are otherwise lost in an inner join.    ✓ Correct

## Set Operations with SQL

Union vs Union all
State whether the following statement is true or false. 

It is preferable to use 'union all' instead of 'union' in a query.


True


False    ✓ Correct

## Practice Questions

Joins
What will be the output of the following query?

select id, col_1, col_2
from table_1 a
inner join table_2 b
using(id)
inner join table_3 c
using(id_2)
 


This query will throw an error message.


This query will perform the inner join of table_1 and table_3 only.


This query will perform an inner join of table_1 and table_2 on ‘id’ and then perform an inner join on ‘id_2’ with table_3    ✓ Correct

Joins
You have been given the following two tables ‘Transactions’ and ‘Company’.
If you perform an inner join on these two tables on ‘Company_id’, then how many rows will the resulting table contain?


4


3    ✓ Correct

Joins
You have been given the following three tables ‘Transactions’, Company’ and ‘Headquarter’.

Suppose you want to get the company name corresponding to the highest amount paid in the ‘Transactions’ table. Which method will be the most efficient to perform such an operation?


Perform the operation in three steps:

First, get the ‘Company_Headquarter_id’ corresponding to the highest amount from the ‘Transactions’ table. 
Then, find the ‘Company_id’ from the ‘Headquarter’ table that corresponds to the ‘Company_headquarter_id’ obtained from the previous step.

Perform the operation on the ‘Company’ table to get the ‘Company_name’.


Perform a nested query operation among the three tables.


Inner join the three tables and query for the maximum amount in the inner joined table directly.    ✓ Correct

Joins
Suppose you have been given the following two tables ‘Customers’ and ‘Orders’.

These two tables are to be joined on the ‘dept_no’ key.

Match each join type with the resulting table.


Select the correct option from below.


A-2, B-1, C-4, D-5, E-3


A-1, B-3, C-2, D-5, E-4


A-4, B-3, C-1, D-2, E-5


A-5, B-3, C-1, D-2, E-4    ✓ Correct

In [1]:
import jovian

In [2]:
jovian.commit()

[jovian] Committed successfully! https://jovian.ai/ashutoshgole18/module-10-database-design-and-introduction-to-mysql

'https://jovian.ai/ashutoshgole18/module-10-database-design-and-introduction-to-mysql'